# Work №1

# Задание
"""
Компьютерлердин арасынан User каалаган компьютерлерди чыгарыш керек! 
"""

# Условие
"""
Всё через input()
1) User ден ар бир поляны сураш керек (кааласа жазат или нет)
2) Если жазса ошондой комптор чыгыш керек
3) Ценаны канчага деп сурагыла 
4) Если жазбаса любой ценадагы комптор(жазса ошого чейинки ценалар)
5) Если сан жаза турган жерге тамга жазса кайра сураш керек


Аягында print() примерно ушинтип чыгыш керек
--------------------------------------------
Computer №1
Name: Acer
Price: 110000
ORM: 8
DISK: HDD
MEMORY: 256
--------------------------------------------
Computer №2
Name: HP
Price: 230000
ORM: 16
DISK: HDD
MEMORY: 512
--------------------------------------------
Общее кол-во: 2

"""

acer = {
    "name": 'Acer',
    "price": 110000, 
    "ORM": 8,
    "DISK": "HDD",
    "MEMORY": 256
}

lenovo = {
    "name": 'Lenovo',
    "price": 86000, 
    "ORM": 4,
    "DISK": "SSD",
    "MEMORY": 128
}

samsung = {
    "name": 'Samsung',
    "price": 99000, 
    "ORM": 8,
    "DISK": "HDD",
    "MEMORY": 1024
}

hp = {
    "name": 'HP',
    "price": 230000, 
    "ORM": 16,
    "DISK": "HDD",
    "MEMORY": 512
}

toshiba = {
    "name": 'Toshiba',
    "price": 150000, 
    "ORM": 4,
    "DISK": "SSD",
    "MEMORY": 256
}
# Озунор Еще кобуроок кошуп алсанар болот ушуга окшогон характеристикалары бар

computers = [acer, lenovo, samsung, hp, toshiba]

# Your code here ...


